#!/usr/bin/env python 
# -*- coding: utf-8 -*- 
# @Time : 2018/12/17 22:44 
# @Author : yangpingyan@gmail.com
division_code_dict = {'330000': '浙江省', '330100': '杭州市', '330102': '上城区', '330103': '下城区', '330104': '江干区',
                      '330105': '拱墅区', '330106': '西湖区', '330108': '滨江区', '330109': '萧山区', '330110': '余杭区',
                      '330111': '富阳区', '330112': '临安区', '330122': '桐庐县', '330127': '淳安县', '330182': '建德市',
                      '330200': '宁波市', '330203': '海曙区', '330205': '江北区', '330206': '北仑区', '330211': '镇海区',
                      '330212': '鄞州区', '330213': '奉化区', '330225': '象山县', '330226': '宁海县', '330281': '余姚市',
                      '330282': '慈溪市', '330300': '温州市', '330302': '鹿城区', '330303': '龙湾区', '330304': '瓯海区',
                      '330305': '洞头区', '330324': '永嘉县', '330326': '平阳县', '330327': '苍南县', '330328': '文成县',
                      '330329': '泰顺县', '330381': '瑞安市', '330382': '乐清市', '330400': '嘉兴市', '330402': '南湖区',
                      '330411': '秀洲区', '330421': '嘉善县', '330424': '海盐县', '330481': '海宁市', '330482': '平湖市',
                      '330483': '桐乡市', '330500': '湖州市', '330502': '吴兴区', '330503': '南浔区', '330521': '德清县',
                      '330522': '长兴县', '330523': '安吉县', '330600': '绍兴市', '330602': '越城区', '330603': '柯桥区',
                      '330604': '上虞区', '330624': '新昌县', '330681': '诸暨市', '330683': '嵊州市', '330700': '金华市',
                      '330702': '婺城区', '330703': '金东区', '330723': '武义县', '330726': '浦江县', '330727': '磐安县',
                      '330781': '兰溪市', '330782': '义乌市', '330783': '东阳市', '330784': '永康市', '330800': '衢州市',
                      '330802': '柯城区', '330803': '衢江区', '330822': '常山县', '330824': '开化县', '330825': '龙游县',
                      '330881': '江山市', '330900': '舟山市', '330902': '定海区', '330903': '普陀区', '330921': '岱山县',
                      '330922': '嵊泗县', '331000': '台州市', '331002': '椒江区', '331003': '黄岩区', '331004': '路桥区',
                      '331022': '三门县', '331023': '天台县', '331024': '仙居县', '331081': '温岭市', '331082': '临海市',
                      '331083': '玉环市', '331100': '丽水市', '331102': '莲都区', '331121': '青田县', '331122': '缙云县',
                      '331123': '遂昌县', '331124': '松阳县', '331125': '云和县', '331126': '庆元县', '331127': '景宁畲族自治县',
                      '331181': '龙泉市'}
social_credit_code1_2 = ['91', '92']
social_credit_code3_8 = division_code_dict.keys()  # 从GBT2260-201808.csv文件里读取


# GB11714-1997全国组织机构代码编制规则中代码字符集
ORGANIZATION_CHECK_CODE_DICT = {
    '0': 0, '1': 1, '2': 2, '3': 3, '4': 4, '5': 5, '6': 6, '7': 7, '8': 8, '9': 9,
    'A': 10, 'B': 11, 'C': 12, 'D': 13, 'E': 14, 'F': 15, 'G': 16, 'H': 17, 'I': 18, 'J': 19, 'K': 20, 'L': 21, 'M': 22,
    'N': 23, 'O': 24, 'P': 25, 'Q': 26,
    'R': 27, 'S': 28, 'T': 29, 'U': 30, 'V': 31, 'W': 32, 'X': 33, 'Y': 34, 'Z': 35}


# 生成校验码
def gen_check_code(weighting_factor, ontology_code, modulus, check_code_dict):
    total = 0
    for i in range(len(ontology_code)):
        if ontology_code[i].isdigit():
            total += int(ontology_code[i]) * weighting_factor[i]
        else:
            total += check_code_dict[ontology_code[i]
                     ] * weighting_factor[i]
    C9 = modulus - total % modulus
    C9 = 0 if C9 == 31 else C9
    C9 = list(check_code_dict.keys())[
        list(check_code_dict.values()).index(C9)]
    return C9


def get_organization_code(ontology_code):
    '''
    生成组织机构代码
    :param ontology_code: 本体代码（组织机构代码前八位）
    :return: 组织机构代码
    '''
    # 第i位置上的加权因子
    weighting_factor = [3, 7, 9, 10, 5, 8, 4, 2]
    modulus = 11

    total = 0
    for i in range(len(ontology_code)):
        if ontology_code[i].isdigit():
            total += int(ontology_code[i]) * weighting_factor[i]
        else:
            total += ORGANIZATION_CHECK_CODE_DICT[ontology_code[i]
                     ] * weighting_factor[i]
    C9 = modulus - total % modulus
    if C9 == 10:
        return ontology_code + 'X'
    else:
        return ontology_code + str(C9)


get_organization_code('MA2CG68B')
